[
  {
    "name": "Manabendra Nath Roy’s Blueprint for a Republican Nation (1944)",
    "description": "M.N. Roy, a visionary thinker and communist ideologue, envisioned a radical \"New India\" where the people held ultimate power. Roy’s draft, presented at the biannual conference of the Radical Democratic Party in December 1944, included 13 chapters and 137 articles. The draft, written three years before India's Independence, proposed a democratic system based on an arrangement of People's Committees. This system was an attempt to bypass the influence of traditional political parties and leaders. /n Roy’s  proposed constitution prioritised questions of social justice and equality. It guaranteed every citizen the right to adequate employment or social assistance, free and compulsory education, and social security for the sick and elderly. Moreover, it advocated for gender equality, recognising the equal rights and responsibilities of all citizens, regardless of gender.\n",
    "documents": [
      "./archive_alternate_constitutions/M N Roy - Draft Consitution.pdf",
      "./archive_alternate_constitutions/M.N. Roy Press Clipping.pdf"
    ],
    "qr_code": ""
  },
  {
    "name": "The Hindu Mahasabha’s The Constitution of Hindusthan Free State Act, 1944",
    "description": "The Hindu Mahasabha sent three copies of a draft constitution, known as The Constitution of Hindusthan Free State Act, 1944, to the Constituent Assembly of India for consideration of the Drafting Committee. /n This documents was drafted by a committee consisting of four lawyers: DV Gokhale, LB Bhopatkar, KV Kelkar, and MR Dhamdhere. The committee first met on 31 May 1944 and held 35 sittings to deliberate on the name of the country, the relationship with the United Kingdom, question of minorities, form of government and legislature, fundamental rights of citizens, among other concerns. A significant proposal was with regard to a provision on People's Rights of Initiative, Referendum and Recall. The committee argued that since “the people were the fountain-source of all power and authority of the State… they should have the power to initiate legislation, to get any proposed legislation referred to themselves for their approval, or otherwise and to recall their representatives in circumstances which they deemed to be proper and necessary.”\n",
    "documents": [
      "./archive_alternate_constitutions/Hindu Mahasabha Constitution 1944.pdf"
    ],
    "qr_code": ""
  },
  {
    "name": "Shriman Narayan Agarwal's Gandhian Constitution (1946)",
    "description": "Shriman Narayan Agarwal was a Gandhian leader and member of the Constituent Assembly of India. Based on a careful study of Mahatma Gandhi's writings, Agarwal drafted a constitution which would best represent the Mahatma’s vision. This draft had a Foreword written by Gandhiji and consisted of 22 chapters divided into two parts. While Gandhiji did not find any inconsistency with his own ideals in the draft, he warned the readers against mistaking “the particular writing being my view in every detail.” /n  S. N. Agarwal presented his draft constitution as a unique vision rooted in indigenous traditions. His proposed constitution emphasised fundamental rights, including the right to free basic education based on the Gandhian conception of education—Nai Talim, the right to rest, a minimum living wage, and medical freedom. However, these rights were predicated on the adherence to certain duties, including loyalty to the state, promotion of public welfare, and resistance to exploitation. Further, Agarwal's constitution advocated for a decentralised governance structure centred around self-sufficient village panchayats, an idea espoused by Gandhiji.",
    "documents": [],
    "qr_code": "./archive_alternate_constitutions/Shriman Narayan Agarwal_s Gandhian Constitution (1946).png"
  },
  {
    "name": "Socialist Party’s Draft Constitution of Indian Republic (1948)",
    "description": "Dissatisfied with the proceedings and vision of the Constituent Assembly of India, the Socialist Party prepared a draft constitution with the help of Mukut Behari Lal, a professor at Banaras Hindu University. In his Foreword to the Socialist Party's draft constitution, Jayaprakash Narayan offered a sharp critique of the Constituent Assembly's deliberations, which he deemed uninspiring and lacking in revolutionary fervour. /n The draft constitution of the Socialist Party laid emphasis on the need for a more radical approach to economic rights, advocating for measures to combat human trafficking and forced labour. While supporting the general direction of the Directive Principles of State Policy, it prioritised the establishment of a socialist economy alongside political democracy. It rejected the notion of a natural right to property, viewing it as a social institution that could hinder progress. Further, it was argued that the state should have the authority to regulate, limit, or expropriate private property in the interest of the common good. This perspective reflected the socialist vision of a more equitable and just society.\n",
    "documents": [],
    "qr_code": "./archive_alternate_constitutions/Socialist Party_s Draft Constitution of Indian Republic (1948).png"
  }
]
