[
  {
    "id": "constituent_1",
    "name": "A. Dharam Dass",
    "bio": "A. Dharam Dass was a member of the Constituent Assembly from United Provinces. He was also a member of the Rajya Sabha for two terms between 1952 and 1960.",
    "image": "",
    "videos": [
      {
        "name": "Parliamentary Debate - 21 May 2023",
        "path": "/videos/parliamentry_debate_21-may-2023.mp4",
        "type": "mp4",
        "size": "9.4 MB",
        "thumbnail": ""
      }
    ],
    "documents": [
      {
        "name": "Document 1",
        "path": "/archive/Archive_1.pdf",
        "type": "pdf",
        "size": "9.4 MB",
        "thumbnail": "/we_the_people.jpg"
      }
    ]
  },
  {
    "id": "constituent_2",
    "name": "A. Karunakara Menon",
    "bio": "A. Karunakara Menon was a member of the Constituent Assembly from Madras.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_3",
    "name": "A. Thanu Pillai",
    "bio": "A. Thanu Pillai was born on 15 July 1885 in Thiruvananthapuram, Kerala. He graduated with a Bachelor of Arts degree and initially taught at a school while working in the State Agriculture department. After earning his law degree, he practised as an advocate but soon left to join the Indian National Congress, serving as State Congress President for nearly 14 years. Pillai represented Travancore in the Constituent Assembly, discussing federalism. After independence, he became the first Prime Minister of Travancore and later the Chief Minister of Travancore-Kochi from 1954 to 1955. Following differences with the Congress, he joined the Praja Socialist Party. He also served as Chief Minister of Kerala from 1960 to 1962 and later as Governor of Punjab and Andhra Pradesh.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_4",
    "name": "Abdul Halim Ghuznavi",
    "bio": "Abdul Halim Ghuznavi was a distinguished Bengali leader and educationist, born into a prominent literary family in Tangail, in present day Bangladesh. Educated at St. Xavier’s College in Calcutta, Ghuznavi began his political career opposing the 1905 Bengal Partition and joined the Congress Party briefly, before going on to become a significant Muslim League figure. Elected to the Central Legislative Assembly in 1926, he held key positions in various committees, including the Railway Standing Finance Committee and the Federal Finance Committee. He actively participated in the Round Table Conferences and presided over the 1929 Muslim League Conference.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_5",
    "name": "Abdul Hamid",
    "bio": "Abdul Hamid was a member of the Constituent Assembly from West Bengal.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_6",
    "name": "Abdul Kadar Mohammad Shaikh",
    "bio": "Abdul Kadar Mohammad Shaikh was a member of the Constituent Assembly from Bombay.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_7",
    "name": "Abdul Kadir Abdul Aziz Khan",
    "bio": "Abdul Kadir Abdul Aziz Khan was a member of the Constituent Assembly from Bombay.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_8",
    "name": "Syed Abdur Rouf",
    "bio": "Syed Abdur Rouf was a member of the Constituent Assembly from Assam. He had previously served in the Assam Legislative Assembly. Rouf was a prominent leader of immigrant Muslims in Assam and one of the proponents of abolishing the line system in Assam.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_9",
    "name": "Acharya Jugal Kishore",
    "bio": "Acharya Jugal Kishore was a member of the Constituent Assembly from the United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_10",
    "name": "Ahsan Raghib",
    "bio": "Allama Raghib Ahsan was a prominent Indian Muslim leader, writer, and politician. Born in Neodhi, Bihar, he later moved to Calcutta for education. His political journey began with the Khilafat Movement at the age of 13, and he was arrested during the Non-Cooperation Movement. Elected to the Constituent Assembly in 1946 on a Muslim League ticket, Ahsan remained focused on advocating for Muslim rights post-independence. After partition, he eventually left for Dhaka, in erstwhile East Pakistan. Ahsan authored works on Islamic economics and Muslim nationhood.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_11",
    "name": "Ajit Prasad Jain",
    "bio": "Ajit Prasad Jain was a prominent Indian politician and freedom fighter. Born in 1902 in Meerut, he graduated from Lucknow University with a law degree before entering politics. Jain joined the Indian National Congress and became a key figure in United Provinces, participating in the Civil Disobedience Movement. He was a long-time member of the All India Congress Committee and served in the U.P. Legislative Assembly (1937-1947). Jain was elected to the Constituent Assembly from the United Provinces, where his contributions focused on equality, emergency provisions, and presidential elections. He held various ministerial roles, including Minister of Rehabilitation and Food and Agriculture. He also served as Governor of Kerala (1965-1966).",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_12",
    "name": "Algu Rai Shastri",
    "bio": "Algu Rai Shastri emerged as a pivotal figure in India's struggle for freedom and nation-building. Shastri's journey from a village in Mau district to the corridors of power was marked by unwavering dedication. His activism began with the Non-Cooperation Movement, and he swiftly rose through the ranks, serving as Secretary of various Congress Committees and a Member of the United Provinces Legislative Assembly. A member of the All-India Congress Committee since 1928, Shastri combined Arya Samaj principles with socialist ideas, later shifting towards a more militant stance. Elected to the Constituent Assembly from the United Provinces, he advocated for Hindi as the national language and critiqued the reliance on the Government of India Act, 1935. Post-independence, he served in the first Lok Sabha and held various roles, including as President of the Uttar Pradesh Congress Committee.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_13",
    "name": "Alladi Krishnaswami Ayyar",
    "bio": "Alladi Krishnaswami Ayyar was a distinguished lawyer and served as the Advocate-General of Madras State from 1929 to 1944. He was awarded Knighthood in 1932, which he later surrendered. Ayyar was elected to the Constituent Assembly from Madras where he played a crucial role, serving on nine committees including the Drafting Committee. He made significant contributions to debates on citizenship, fundamental rights, and emergency proclamations.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_14",
    "name": "Amiyo Kumar Ghosh",
    "bio": "Amiyo Kumar Ghosh was an Indian politician who served as a member of the Constituent Assembly representing Bihar. He also held a seat in the Bihar Legislative Assembly.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_15",
    "name": "Ammu Swaminathan",
    "bio": "Ammu Swaminathan was an important leader in both the Indian independence movement and the fight for women’s rights. She, alongside Kamaladevi Chattopadhyay and others, founded the Women's India Association in 1917. This organisation played a crucial role in advocating for women's suffrage and combating social injustices like child marriage. Swaminathan's activism continued as she joined the Indian National Congress in 1934 and participated in the Quit India Movement. In the Constituent Assembly, she championed fundamental rights and directive principles. Post-independence, she served in the first Lok Sabha and the Rajya Sabha. Additionally, she held leadership roles in the film and scouting sectors, becoming Vice President of the Federation of Film Societies and President of the Bharat Scouts and Guides from 1960 to 1965.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_16",
    "name": "Amritlal Vithaldas Thakkar",
    "bio": "Amritlal Vithaldas Thakkar, popularly known as Thakkar Bappa, was a prominent social worker who worked tirelessly towards the upliftment of the economically and socially disinherited sections of society. He shifted his focus to social work after witnessing the poor living conditions of scavengers in Bombay. Thakkar was elected to the Constituent Assembly from Saurashtra. He was the Chairman of the Constituent Assembly’s Excluded and Partially Excluded Areas (Other than Assam) and toured extensively to India’s most remote areas to conduct investigations into the conditions of people.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_17",
    "name": "Annie Mascarene",
    "bio": "Annie Mascarene, from Trivandrum, was a pioneering force in Indian politics and education. With dual M.A. degrees in history and economics, she became a lecturer in Sri Lanka before returning to Trivandrum to earn a law degree. Mascarene's political journey saw her serve in the Travancore-Cochin Legislative Assembly from 1948 to 1952, where she briefly held the role of Minister for Health and Power. In the Constituent Assembly, she made notable contributions to discussions on the subject of federalism. She became the first independent woman candidate to be elected from Kerala Lok Sabha, where she advocated vigorously for women's representation in politics.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_18",
    "name": "Anugrahnarayan Sinha",
    "bio": "Anugrahnarayan Sinha, popularly known as ‘Bihar Vibhuti’, was an ardent follower of Gandhi and led Satyagraha movements in Bihar. As a key member of the Congress Party, he helped organise the Gaya Congress in 1922. Sinha was involved in major political movements, including the Civil Disobedience movement (1930) and the Individual Satyagraha (1940), which led to his arrest. Sinha was elected to the Constituent Assembly from Bihar. He remained a key figure in Bihar politics even after independence and was elected to the first Bihar Legislative Assembly post-independence.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_19",
    "name": "Ari Bahadur Gurung",
    "bio": "Ari Bahadur Gurung was a member of the Constituent Assembly from West Bengal.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_20",
    "name": "Arun Chandra Guha",
    "bio": "Arun Chandra Guha was a dynamic figure in India’s political and intellectual landscape. Born in Barisal, Bengal, Guha graduated from Braja Mohan College and established a publishing house, Saraswati Library, where he championed radical literature. A member of the Jugantar Party, he was frequently imprisoned for his revolutionary activities. Transitioning to mainstream politics, Guha joined the Indian National Congress and played a significant role in the non-cooperation movement, later becoming General Secretary of the West Bengal Pradesh Congress Committee. In the Constituent Assembly, he contributed notably to debates on constitutional drafts. Post-independence, Guha served as a Lok Sabha member and Minister of State for Finance during his first term in the Lok Sabha. He also chaired the Estimates Committee (1965-66), wherein he recommended changes to the functioning of the University Grants Commission and influenced higher education reforms.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_21",
    "name": "Awadhesh Pratap Singh",
    "bio": "Awadhesh Pratap Singh was a prominent Indian freedom fighter and politician from Vindhya Pradesh. A committed Congress leader, he served on the Congress Constitution Framing Committee in 1935 and led the Mahakoshal PCC as President in 1937. He was the Prime Minister of Rewa State from May 1948 to April 1949 and Chief Minister of Vindhya Pradesh until April 1949. Singh served as a member of the Constituent Assembly, Provisional Parliament, and Rajya Sabha.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_22",
    "name": "B. Das",
    "bio": "B. Das was a member of the Constituent Assembly from Orissa.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_23",
    "name": "B. L. Sondhi",
    "bio": "B. L. Sondhi was a member of the Constituent Assembly from East Punjab.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_24",
    "name": "B. Pocker Sahib",
    "bio": "B. Pocker Sahib was an influential politician and lawyer. He submitted a memorandum to Lord Montagu advocating for special constituencies for Muslims, influencing the Government of India Act, 1919. He played a significant role in the Khilafat movement and led relief efforts for those affected by the 1921 Mapilla revolt, while also promoting education for the Mapilla community through the South Indian Muslim Education Society. Pocker was elected to the Constituent Assembly on a Muslim League ticket from Madras. He was one of the few members who chose to stay in India after Partition, actively participating in debates on issues like the Uniform Civil Code. He was elected to the Lok Sabha in 1952 and again in 1957 as an independent candidate.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_25",
    "name": "B. R. Ambedkar",
    "bio": "Dr Bhimrao Ramji Ambedkar played a pivotal role in the Constituent Assembly. As Chairman of the Drafting Committee, he was instrumental in shaping the Constitution of India. Ambedkar’s profound understanding and leadership were evident through his extensive interventions and speeches, which significantly influenced the Assembly’s debates. He also submitted the 'States and Minorities' report, outlining essential protections for Scheduled Castes. His meticulous work and advocacy earned him the title of the 'Father of the Indian Constitution,' reflecting his critical role in framing a just and inclusive legal framework for independent India.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_26",
    "name": "B. V. Keskar",
    "bio": "B. V. Keskar, born in Pune in 1903, was a distinguished figure in India's political and cultural realms. Educated at Kashi Vidyapith and Sorbonne, Paris, Keskar joined the Indian National Congress during the Non-Cooperation Movement of 1921 and served as Secretary in the Foreign Department and later as General Secretary of the party. He was elected to the Constituent from United Provinces. After independence, Keskar held several roles as Deputy Minister of External Affairs (1948-52), as well as Deputy Minister of Railways and Transport (1952), and later as Minister of Information and Broadcasting (1952-57). A passionate advocate for classical Indian music, he spearheaded initiatives like Vrinda Vadya and the National Programme of Music on All India Radio.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_27",
    "name": "Babu Ramnarayan Singh",
    "bio": "Ramnarayan Singh, known as ‘Chotanagpur Kesri,’ was a prominent freedom fighter from the Chotanagpur region. He served as Secretary and President of the Chatra Sub-Divisional Congress Committee, and briefly as Vice-Chairman of the Hazaribagh District Board. He was elected to the Central Legislative Assembly in 1927 and served until 1946 and was also a long-time member of the Bihar Pradesh Congress Committee. Singh was elected to the Constituent Assembly from Bihar. He was distressed by the absence of Panchayats in the Constitution, and expressed discontent about party politics in India. Singh intervened in the debates on the fifth schedule and the role of civil servants in an independent India.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_28",
    "name": "Bakhshi Tek Chand",
    "bio": "Bakhshi Tek Chand, a Judge and Chief Justice of the Lahore High Court, joined the Congress in the early 1900s. He later served as a member of the Punjab Legislative Council. He was elected to the Constituent Assembly from East Punjab on a Congress Party ticket, Chand actively participated in debates advocating for personal liberty and the separation of powers. In 1949 he was appointed the Chairman to the Patents Enquiry Committee, which aimed to reform the existing patent system.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_29",
    "name": "Balachandra Maheshwar Gupte",
    "bio": "Balachandra Maheshwar Gupte was a member of the Constituent Assembly from Bombay.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_30",
    "name": "Balasaheb Gangadhar Kher",
    "bio": "Balasaheb Gangadhar Kher was a prominent figure in Indian politics and education. A scholar with distinctions from Wilson College and a seasoned solicitor, Kher established the Bombay Law Journal. Inspired by Tilak and Gandhi, Kher joined the Indian freedom movement. Kher became the Chief Minister of Bombay in 1947. In his second term, he helped establish the Poona University in 1949. He was elected to the Constituent Assembly from Bombay. Post-independence, he served as High Commissioner to the UK and chaired the Official Languages Commission. For his service to the country, he was awarded the Padma Vibhushan in 1954.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_31",
    "name": "Balkrishna Sharma",
    "bio": "Balkrishna Sharma was a member of the Constituent Assembly from United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_32",
    "name": "Balwant Sinha Mehta",
    "bio": "A graduate of Fergusson College, Pune, Mehta emerged as a key figure in the Congress movement within Vindhya Pradesh. His dedication to social causes extended beyond politics, as he actively participated in caste-based organisations like the All India Adimjati Sewak Sangh and the All India Marwari Sammelan. Imprisoned twice for his participation in the freedom struggle, Mehta joined the Constituent Assembly in 1948, representing the United States of Rajasthan. After independence, Mehta was elected to India’s first Lok Sabha in 1952, representing Udaipur. He contributed to the Parliamentary Delimitation Committee for Rajasthan in 1951 and the Delimitation Commission of India in 1953.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_33",
    "name": "Balwant Rai Gopalji Mehta",
    "bio": "Balwant Rai Gopalji Mehta, born in Bhavnagar, Gujarat, attended Samaldas College and Gujarat College but did not graduate due to his refusal to accept colonial recognition. Active in Congress politics since the 1920s, Mehta participated in key movements, including the Non-Cooperation and Quit India Movements. He played a significant role in the All-India States Peoples Conference and briefly served as Prime Minister of Bhavnagar State. Elected to the Constituent Assembly from Saurashtra, he contributed to the Congress party's structure post-independence, eventually becoming Chief Minister of Gujarat in 1963.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_34",
    "name": "Banarsi Prasad Jhunjhunwala",
    "bio": "Banarsi Prasad Jhunjhunwala was a member of the Constituent Assembly from Bihar. He was later elected to the 1st and 2nd Lok Sabha from Bhagalpur, Bihar.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_35",
    "name": "Banshi Dhar Misra",
    "bio": "Banshi Dhar Mishra was a member of the Constituent Assembly from the United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_36",
    "name": "Basanta Kumar Das",
    "bio": "Basanta Kumar Das was a freedom fighter from West Bengal who played a significant role in India’s independence movement. Born in Ramchan village, he graduated from Presidency College, Calcutta, and joined a revolutionary group during his student days. In 1921, Das became a member of the Indian National Congress and was arrested six times for participating in freedom movements like the Non-Cooperation, Civil Disobedience, and Quit India movements. Elected to the Constituent Assembly from West Bengal, Das contributed to debates on the Assembly's authority. Post-independence, he was active in the Provisional Parliament, the First Lok Sabha, and the West Bengal Legislative Council. He also led agricultural delegations and worked on educational and rehabilitation committees, leaving a lasting impact on post-colonial India.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_37",
    "name": "Basavaneppa N. Munavalli",
    "bio": "Basavaneppa N. Munavalli was educated in Dharwar and Poona and established his legal practice in Hubli, where he became a prominent advocate for citizens' rights. A key player in local movements, he led the Ramdurg Samsthan Prajasangha against oppressive land revenue policies and was arrested multiple times for his activism. Munavalli was elected to the Constituent Assembly from the Bombay States. He was also involved in the Karnataka unification movement and contested the 1957 Lok Sabha elections.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_38",
    "name": "Bashir Husain Zaidi",
    "bio": "Bashir Husain Zaidi served as the Chief Minister of Rampur, a princely state, from 1937 to 1949. In the Constituent Assembly, he represented Rampur-Benares States, where he advocated for minority rights and the importance of democracy. After independence, he served in the Provisional Parliament. He served as a member of the Indian Council of Technical Education and the Indian Delegation to the General Assembly of the United Nations (1951). Zaidi also played significant roles in education and industry, serving on the Indian Council of Technical Education and various boards.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_39",
    "name": "Begum Aizaz Rasul",
    "bio": "Begum Aizaz Rasul was a pioneering Indian politician and the only Muslim woman in the Constituent Assembly. Born into a princely family, she entered politics early and was elected to the U.P. Legislative Assembly in 1937, where she held significant positions, including Leader of the Opposition. Rasul strongly opposed the partition of India and feudal practices like the Zamindari system. Rasul was the only Muslim woman in the Constituent Assembly, contributing to discussions on national language and minority rights. After independence, she was elected to the Rajya Sabha and later the U.P. Legislative Assembly. She also championed women's hockey, leading the Indian Women’s Hockey Federation for two decades.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_40",
    "name": "Benegal Shiva Rao",
    "bio": "Benegal Shiva Rao, influenced by his older brother Sanjiva Rao and mentor Annie Besant, began his political journey as a sub-editor at Besant's New India in 1917. In the 1920s, he engaged in constitutional reform, working alongside Besant on the Commonwealth of India Bill and participating in the Indian Round Table Conference. As a trade union leader, he represented Indian workers at the International Labour Organisation Conference and led the National Trades Union Federation. From the 1930s, he wrote for The Hindu and The Manchester Guardian, connecting with key figures in the independence movement. Elected to the Constituent Assembly from Madras, Rao contributed significantly to the documentation of India's constitution-making process. He later served in India's first Lok Sabha and later in the Rajya Sabha.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_41",
    "name": "Bhagwan Din",
    "bio": "Bhagwan Din was a member of the Constituent Assembly from United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_42",
    "name": "Bhagwantrao Annabhau Mandloi",
    "bio": "Bhagwantrao Annabhau Mandloi was an eminent freedom fighter, played a significant role in India's freedom struggle. He was imprisoned during the Quit India Movement in 1940 and 1942. His served as a member of the Central Provinces and Berar Legislative Council and later as a member of the Legislative Assembly. Mandloi was elected to the Constituent Assembly from Central Provinces and Berar. Later he served as the Revenue Minister of Madhya Pradesh from 1956 to 1962. He even served as the Chief Minister of Madhya Pradesh from 1962 to 1963.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_43",
    "name": "Bhagwat Prasad",
    "bio": "Bhagwat Prasad was a member of the Constituent Assembly from Bihar.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_44",
    "name": "Bhawanji Arjan Khimji",
    "bio": "Bhawanji Arjan Khimji was an Indian politician, businessman, and freedom fighter from Maharashtra. A cotton merchant, he was involved in the Indian independence movement, participating in both the Satyagraha and Quit India movements. He held significant positions within the Congress Party and local administration, serving on the Bombay Municipal Corporation and as a member of the Bombay Legislative Assembly. He was elected to the Constituent Assembly from Cutch State. After independence, he served in the First Lok Sabha from 1952 to 1957 and remained involved with the All-India Congress Committee for over 15 years.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_45",
    "name": "Bhogaraju Pattabhi Sitaramayya",
    "bio": "Bhogaraju Pattabhi Sitaramayya was a freedom fighter and doctor from Masulipatnam, Andhra Pradesh. In 1919, he founded the weekly English publication, Janmabhumi. Sitaramayya left his medical career in 1916 to actively engage in the Indian freedom movement, joining the Congress party and participating in key movements like the Home Rule movement, Salt Satyagraha, and Quit India. Elected to the Constituent Assembly from the Madras province in 1946, he played a crucial role in negotiations for integrating princely states into India and chaired the Committee of Chief Commissioners’ Provinces, influencing the administrative setup for Delhi. His significant contributions included interventions on issues like the privy purse and separate electorates. Sitaramayya later served as Governor of Madhya Pradesh from 1952 to 1957.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_46",
    "name": "Binodanand Jha",
    "bio": "Binodanand Jha joined the freedom movement after Mahatma Gandhi’s call for freedom in 1919. He led the Non-Cooperation, Civil Disobedience, and Quit India movements in the Santhal Pargana region. Jha was elected to the Constituent Assembly in 1948 from Bihar on a Congress ticket. Post-independence he joined the Bihar Legislature, even became the third Chief Minister of Bihar in 1961.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_47",
    "name": "Biswanath Das",
    "bio": "Born in Ganjam district, Biswanath Das obtained a law degree from Calcutta University and began practising law in Berhampur, where he advocated for tenant farmers. His political career began in the Madras Legislative Council, where he served from 1921 to 1930. After Ganjam merged with Odisha, Das became the Prime Minister of Odisha in 1936. A staunch advocate for India's independence, Das resigned from the Legislative Council to join the Salt Satyagraha and was imprisoned during the Quit India movement in 1942. Elected to the Constituent Assembly on a Congress ticket, he contributed significantly to discussions on emergency provisions and revenue distribution. After independence, he served as Governor of Uttar Pradesh from 1962 to 1967 and became Chief Minister of Orissa in 1971, leading the United Front coalition until 1972.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_48",
    "name": "Boniface Lakra",
    "bio": "Boniface Lakra represented Bihar in the Constituent Assembly. He had earlier been elected as a member of the Bihar Legislative Assembly.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_49",
    "name": "Brajeshwar Prasad",
    "bio": "Brajeshwar Prasad, an influential figure in Indian politics, founded the Civil Liberties Union (Gaya) in 1937. He played key roles in agriculture and labour movements, including the Khetihar Mazdoor Sangh. A prominent freedom fighter, Prasad actively participated in the Quit India Movement and other national movements, leading to his imprisonment in 1944. Prasad was elected as a member of the Constituent Assembly from Bihar. During the debates in the Assembly he contributed to the discussions on citizenship, the preamble, Centre-State relations, and public health.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_50",
    "name": "Brijlal Nandlal Biyani",
    "bio": "Brijlal Nandlal Biyani was an Indian freedom fighter and writer, popularly known as Vidarbha Kesari. Influenced by Mahatma Gandhi, Biyani participated actively in the Non-Cooperation Movement, the Civil Disobedience Movement, and the Quit India Movement, facing imprisonment four times. He was elected to the Constituent Assembly from Central Provinces & Berar. In recognition of his contributions, the Brijlal Biyani Science College in Amravati was named after him, and the Government of India issued a postage stamp in his honour in 2002.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_51",
    "name": "Brijraj Narain",
    "bio": "Narain was a member of the Constituent Assembly from Madhya Bharat.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_52",
    "name": "C. Perumalswami Reddi",
    "bio": "C. Perumalswami Reddi was a member of the Constituent Assembly from Madras.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_53",
    "name": "Chandrika Ram",
    "bio": "Chandrika Ram was a prominent Dalit leader, lawyer, and politician from Bihar. Born in Saran, he pursued his education at Patna University, where he became the first Dalit lawyer in the region, practising at Patna High Court. He joined the Indian independence movement during the Quit India movement and was imprisoned for his participation. Ram was a leading figure in the Dalit movement in Bihar, serving as the President of the Bihar Provincial Depressed Classes League. Elected to the Constituent Assembly in 1946, he advocated for reservations for backward classes in employment. After India’s independence, he held several political roles, including Deputy Minister of Bihar, and continued his work for Dalit welfare. He authored A Plan for Harijans and Other Backward Classes.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_54",
    "name": "Chaudhri Ranbir Singh",
    "bio": "Chaudhri Ranbir Singh was a prominent leader of the freedom struggle from Punjab. For his participation in Satyagraha and Quit India movements he was arrested multiple times. He was elected to the Constituent Assembly from East Punjab, where he intervened on a variety of issues like Delhi’s provincial autonomy, minimum economic price of agricultural produce, and Profession Tax. He is the only person to have served as a member of seven different legislative houses including the Constituent Assembly and Provincial Legislature.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_55",
    "name": "Cheppudira Muthanna Poonacha",
    "bio": "Cheppudira Muthanna Poonacha was a prominent leader of the Indian freedom struggle. He was actively involved in various movements, facing imprisonment during the Salt Satyagraha and the Quit India movement. He was a significant political figure in Coorg, serving as Secretary of the Coorg District Congress Committee and later as the leader of the Congress in the Coorg Legislative Council, where he was elected in 1945. Poonacha even represented Coorg in the Constituent Assembly. After independence, he became Coorg's first and last Chief Minister following its merger with Mysore State in 1956.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_56",
    "name": "Chidambaram Subramaniam",
    "bio": "Chidambaram Subramaniam was a prominent leader and lawyer from Madras. He began his career as a lawyer before venturing into politics with the Indian National Congress. There he held key positions including President of the Coimbatore District Congress Committee and member of the State Congress Working Committee. Subramaniam played an active role in India’s independence struggle, notably participating in the Quit India movement, which led to his imprisonment in 1932 and 1941. He was elected to the Constituent Assembly from Madras, where he contributed to debates on freedom of trade and commerce. Post-independence, he served in the Madras Legislative Assembly and the Lok Sabha, holding important Cabinet positions in Steel and Mines, Agriculture, Finance, and Defence. As Agriculture Minister, he initiated the Green Revolution, significantly boosting India's food production. He was awarded the Bharat Ratna in 1998.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_57",
    "name": "Chimanlal Chakubhai Shah",
    "bio": "Shah was a distinguished Congress leader and legal expert from Saurashtra. A prominent solicitor with the Government of Bombay, Shah was actively involved in municipal and legislative affairs. He served as a member of the Bombay Municipal Corporation and contributed to the Committee on Shops and Establishments Act. He was elected to the Lok Sabha in 1952.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_58",
    "name": "D. Govinda Doss",
    "bio": "Doss was a member of the Constituent Assembly from Madras.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_59",
    "name": "Dakshayani Velayudhan",
    "bio": "Dakshayani Velayudhan was a pioneering Dalit woman politician and activist from Kerala. Born into the Pulaya community, she defied oppressive caste norms from a young age. Velayudhan's activism was fueled by her family's involvement in Civil Disobedience and the 1913 Kayal Sammelanam. Elected to the Constituent Assembly in 1946, she was the only Dalit woman member and one of the youngest at age of 34. Velayudhan made significant interventions, challenging the proposed centralization of power and advocating for substantial societal reforms. Post-independence, she served in the Provincial Parliament, continued her work for Dalit rights, and founded the Mahila Jagriti Parishad. The Kerala Government established an award in her honour in 2019.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_60",
    "name": "Damodar Swarup Seth",
    "bio": "Damodar Swarup Seth was born in February 1896 in Bareilly, Uttar Pradesh. He completed his education at Government High School and Reid Christian College in Lucknow. A prominent figure in the Indian freedom struggle, Seth was arrested multiple times, notably for his involvement in the 1925 Kakori Conspiracy Case. He held key roles in various political organisations, including the All India Congress Committee, and served as Secretary of the Congress Socialist Party in 1935 and President of the UP Congress Committee in 1946. Elected to the Constituent Assembly from the United Provinces on a Congress ticket, Seth focused on Fundamental Rights and advocated for a new Constituent Assembly.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_61",
    "name": "Dayal Das Bhagat",
    "bio": "Dayal Das Bhagat was a member of the Constituent Assembly from the United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_62",
    "name": "Devendra Nath Samanta",
    "bio": "Devendra Nath Samanta was deeply influenced by Motilal Nehru, Mahatma Gandhi, and others, which led him to join the freedom movement. He actively participated in the Civil Disobedience Movement, Individual Satyagraha, and the Quit India Movement, facing multiple arrests. Between 1926 and 1950, Samanta served as an M.L.C., M.L.A., and a member of the Constituent Assembly. Throughout his career, he was dedicated to uplifting the downtrodden and his contributions won the Padma Shri Award.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_63",
    "name": "Dharam Prakash",
    "bio": "Dharam Prakash was a member of the Constituent Assembly from the United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_64",
    "name": "Dharanidhar Basu Matari",
    "bio": "Dharanidhar Basu Matari was elected to the Constituent Assembly from Assam. Post-Independence, he was elected to the Lok Sabha from Kokrajhar constituency in Assam between 1957-1977.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_65",
    "name": "Dip Narayan Sinha",
    "bio": "Dip Narayan Sinha was a Judge in the Calcutta High Court. He was a member of the Constituent Assembly.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_66",
    "name": "Durbar Gopaldas A. Desai",
    "bio": "Desai was a prince who embraced the freedom struggle under Mahatma Gandhi’s influence. He renounced royal symbols and joined the Swaraj movement, serving as President of the Kheda District Local Board. Gopaldas participated in key movements like the Nagpur Flag Satyagraha (1922) and the Borsad Satyagraha (1923), facing multiple imprisonments. A pivotal figure in the Bardoli Satyagraha, Gopaldas was arrested during the Dandi March (1930) and the Quit India Movement (1942). In the Constituent Assembly, he represented Kathiawar States and contributed to discussions on the rights and welfare of princely states. He also presided over the Haripura Congress session in 1938.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_67",
    "name": "Feroze Gandhi",
    "bio": "Feroze Gandhi was a Congress member from the United Provinces. Born in Bombay, he studied at the London School of Economics before joining the Indian freedom struggle in 1930. Gandhi was imprisoned several times for his activism, including for his involvement in the Quit India Movement. He played a crucial role after India gained independence. Elected to the Constituent Assembly from the United Provinces, he played a limited role in debate. He championed press freedom through the Parliamentary Proceedings (Protection of Publication) Act, 1956. He exposed India’s first financial scandal in 1957, leading to a minister’s resignation. He was a member of the Lok Sabha in 1952 and 1957. Gandhi was married to Indira Gandhi, who later became India’s first woman Prime Minister.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_68",
    "name": "Frank Anthony",
    "bio": "Frank Anthony was one of the prominent members of the Anglo-Indian community, who became the head of the All India Anglo-Indian Association in 1942. He was elected to the Constituent Assembly from Central Provinces and Berar. Apart from being a member, he served as the temporary Vice President of the Constituent Assembly and was also part of the Advisory Committee and Sub-committee on Minorities. Post-Independence, Anthony served as a nominated Anglo-Indian member of the Lok Sabha seven times.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_69",
    "name": "G. Durgabai",
    "bio": "G. Durgabai was a freedom fighter and public activist for women’s emancipation. In 1936, she founded the Andhra Mahila Sabha to support young Telugu girls in their education and edited the Telugu journal Andhra Mahila. Elected to the Constituent Assembly from Madras, she advocated for the national language, judicial independence, and human trafficking issues. Post-Independence, Durgabai served in organisations like the Central Social Welfare Board and the Planning Commission, and headed the National Committee on Girls’ and Women’s Education in 1958. She received the Padma Vibhushan in 1975.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_70",
    "name": "G. S. Guha",
    "bio": "G. S. Guha was elected to the Constituent Assembly from the Tripura, Manipur, and Khasi States.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_71",
    "name": "Ganesh Vasudev Mavalankar",
    "bio": "Ganesh Vasudev Mavalankar was a politician and freedom fighter. He played an active role in the freedom movement in Gujarat. He became the Secretary of the Gujarat Provincial Congress Committee in 1921. He was elected to the Constituent Assembly from Bombay. Mavalankar later became the speaker of the Provisional Parliament in 1951 and later became the Speaker First Lok Sabha in 1952. Jawaharlal Nehru referred to him as the ‘Father of the Lok Sabha’ for his contribution in setting up various Parliamentary committees related to the functioning of the House.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_72",
    "name": "Ghanshyam Singh Gupta",
    "bio": "Ghanshyam Singh Gupta, a prominent member freedom fighter from Durg, Chhattisgarh. He was elected as a member of the Constituent Assembly from Central Province and Berar. Gupta served as the Chairman of the Hindi Translation Committee, overseeing the translation of the Constitution into Hindi.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_73",
    "name": "Giani Gurmukh Singh Musafir",
    "bio": "Giani Gurmukh Singh Musafir was a prominent leader and a teacher from Punjab. The Jallianwala Bagh and Nankana Saheb massacres led him to leave teaching in 1922 and join the freedom struggle. He actively participated in the Akali movement facing multiple imprisonments. He became a member of the All India Congress Committee in 1930 and Jathedar of the Akal Takht. Elected to the Constituent Assembly from East Punjab on a Congress ticket, he contributed to debates on citizenship and separate electorates. Later Giani served multiple terms in the Lok Sabha and was a member of the Rajya Sabha from 1968 to 1974. For his contribution, he was posthumously awarded the Padma Vibhushan in 1976.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_74",
    "name": "Gokul Lal Asawa",
    "bio": "Gokul Lal Asawa was a notable Congress leader and educator from Rajasthan. A professor of logic at Herbert College, Kotah, he was a dedicated freedom fighter, imprisoned multiple times for his participation in Congress movements. Asawa was a prominent member of the Ajmer-Merwara PCC, serving as its President and General Secretary. He played a key role in the formation of Rajasthan, serving as Prime Minister of Shahpura State, and later the United State of Rajasthan. He was also a Minister for Revenue and Planning.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_75",
    "name": "Gokulbhai Daulatram Bhatt",
    "bio": "Gokulbhai Daulatram Bhatt was a prominent social worker and activist known as the 'Gandhi of Rajasthan.' Born in Sirohi, Rajasthan, he was deeply influenced by Mahatma Gandhi. Bhatt left his studies at St. Xavier’s College, Bombay, to join the Non-Cooperation Movement in 1921 followed by the Salt Satyagraha and the Quit India Movement. In 1939, Bhatt founded the Sirohi Praja Mandal, advocating for Purna Swaraj and the integration of princely states. He was elected to the Constituent Assembly from Bombay States, where he championed local democracy and the integration of princely states. Post-independence, Bhatt served on the All-India Khadi and Village Industries Board and was awarded the Padma Bhushan in 1971 for his social contributions.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_76",
    "name": "Gopal Narain",
    "bio": "Gopal Narain was a member of the Constituent Assembly from the United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_77",
    "name": "Gopikrishna Vijayavargiya",
    "bio": "Gopikrishna Vijayavargiya was a member of the Constituent Assembly from Madhya Bharat.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_78",
    "name": "Gopinath Bardoloi",
    "bio": "Gopinath Bardoloi was the first Chief Minister of Assam. He played an integral role in setting up educational institutions and promoting industrial growth in Assam. He was elected as a member of the Constitutional Assembly from Assam. In the Assembly, he was the chairman of the sub-committee on North-East Frontier Tribal Areas and Assam Excluded & Partially Excluded Areas. He was the voice of tribal rights and representation in the Constituent Assembly.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_79",
    "name": "Govind Ballabh Pant",
    "bio": "Govind Ballabh Pant was born in Almora, Uttarakhand. He studied law and enrolled as an advocate in 1909, he rose to prominence in Nainital's legal community, notably for assisting village council against British transportation laws. Pant founded the Kumaon Parishad in 1916 and joined the All-India Congress Committee, becoming a key figure in Congress politics. He faced severe police brutality during protests against the Simon Commission in 1928, resulting in a permanent disability. He served as President of the United Province Congress Committee and became Prime Minister of the United Province in 1937. Pant participated in the Salt March and the Quit India Movement, facing multiple arrests. Elected to the Constituent Assembly, he contributed to debates on citizenship and federalism. As the first Chief Minister of Uttar Pradesh from 1950 to 1955 and later as Home Minister, he was awarded the Bharat Ratna in 1957.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_80",
    "name": "Govind Malaviya",
    "bio": "Govind Malaviya was the youngest son of Madan Mohan Malaviya. Malaviya joined the Congress in 1920. His activism led to eight imprisonments, and he played a significant role in the Second Round Table Conference and the All-Parties Unity Conference. Elected to the Constituent Assembly from the United Provinces, he contributed to debates on presidential elections, constitutional reviews, and reservations. Post-independence, Malaviya served as Vice-Chancellor of Banaras Hindu University and as a Member of Parliament from Sultanpur (1952–1957).",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_81",
    "name": "Guptanath Singh",
    "bio": "Guptanath Singh was a member of the Constituent Assembly from Bihar.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_82",
    "name": "H. C. Mookerjee",
    "bio": "Born in Calcutta, Mookerjee pursued higher education at Ripon College and Presidency College before embarking on a distinguished academic career, ultimately becoming Vice-Chancellor of the University of Calcutta. A leading figure in the Indian National Congress and a prominent Bengali Christian leader, he served as the President of the All India Council of Indian Christians. In the Constituent Assembly, Mookerjee played a key role as Chairman of the Sub-Committee on Minorities and Vice-President of the Assembly, advocating for reservations and minority rights. Later, as Governor of Bengal (1951–56), he continued to influence public policy until his death in 1956.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_83",
    "name": "H. J. Khandekar",
    "bio": "H. J. Khandekar was a prominent Dalit leader, who advocated for the rights of the Depressed Classes. He became the secretary of Madhya Prantiya Tarun Mahar Sangh in 1926 and was a member of the All India Depressed Classes Association. Khandekar then joined the Indian National Congress in 1942. He was elected to the Central Provinces and Berar Legislative Assembly and became a member of the Constituent Assembly. In the Assembly, he voiced the grievances of the lower castes.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_84",
    "name": "H. R. Guruv Reddy",
    "bio": "H. R. Guruv Reddy was a member of the Constituent Assembly from Mysore State.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_85",
    "name": "H. Siddaveerappa",
    "bio": "H. Siddaveerappa was a member of the Constituent Assembly from Mysore State.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_86",
    "name": "Hansa Jivraj Mehta",
    "bio": "One of 15 women framers of the Constitution, Hansa Jivraj Mehta was a trailblazing figure in Indian politics and women’s rights. She studied philosophy and journalism in England, where she met Sarojini Naidu and Mahatma Gandhi. Mehta was elected to the Bombay Legislative Council in 1937 and played a pivotal role in drafting the Indian Women’s Charter of Rights and Duties. As a member of the Constituent Assembly, she advocated for women’s rights, intervened on issues like the uniform civil code. Later, she significantly contributed to the UN Universal Declaration of Human Rights, ensuring inclusivity in Article 1. Mehta was awarded the Padma Bhushan in 1959.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_87",
    "name": "Har Govind Pant",
    "bio": "Har Govind Pant was born in Almora, Uttar Pradesh. He graduated from Muir Central College and obtained a law degree from Allahabad School of Law in 1909. Pant was an active contributor to local newspapers, promoting nationalist ideas and educating the public on political issues. He founded the Kumaon Parishad to oppose British repression and led grassroots campaigns against the oppressive begar system (forced labour). His political involvement included serving as President of the District Congress and participating in the All-India Congress Committee for five years. Notably, he initiated the Salt Satyagraha and played a significant role in the Quit India Movement in 1942. In 1935, he was elected to the U.P. Legislative Council. After independence, Pant was elected Deputy Speaker of the United Provinces Legislature and chaired the Rules of Procedure Committee. He passed away on May 18, 1957.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_88",
    "name": "Hare Krishna Mahtab",
    "bio": "Hare Krishna Mahtab was a member of the Constituent Assembly from Orissa.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_89",
    "name": "Hari Vinayak Pataskar",
    "bio": "Hari Vinayak Pataskar joined the Indian National Congress in 1920 and became actively involved in regional politics, winning a seat on the Bombay Council in 1926. As a lawyer, he provided free legal services to political prisoners from 1925 to 1945. Pataskar served on the Bombay Legislative Assembly twice. He was elected to the Constituent Assembly from Bombay, and contributed to debates on preventive detention, due process, and anti-discrimination. Later he was elected to the Lok Sabha in 1952, where he became Union Law Minister, introducing the Hindu Code Bill. He later served as Public Aviation Minister from 1955 to 1957 and was appointed Governor of Madhya Pradesh, holding the position for over seven years.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_90",
    "name": "Hari Vishnu Kamath",
    "bio": "Hari Vishnu Kamath had a successful career in the Indian Civil Service, serving in various roles until 1938, which he left to join the independence movement as General Secretary of Subhash Chandra Bose’s Forward Bloc. Elected to the Constituent Assembly from Central Provinces and Berar, he became known for his bold and often eccentric interventions. He advocated for individual rights, democratic values, linguistic diversity, and a balanced federal system, while expressing concerns about emergency provisions and state power overreach. After falling out with Congress, he joined the Praja Socialist Party, winning a seat in India’s first Lok Sabha after a legal battle.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_91",
    "name": "Harihar Nath Shastri",
    "bio": "Harihar Nath Shastri was born on 26 October 26 1904, in Wazirapur, Uttar Pradesh. He studied at the Edward Memorial Institute, Benaras Hindu University, and Kashi Vidyapith. An active member of the Indian National Congress since 1928, Shastri was imprisoned seven times for his participation in the independence movement and played significant roles in civil society organisations, including the Servants of People Society. He was instrumental in the labour movement in Uttar Pradesh, especially in the textile industry, advocating for workers' rights and linking their upliftment to national freedom. Shastri edited a magazine called Mazdoor to mobilise labourers politically. Elected to the Constituent Assembly in 1946, he did not actively participate in debates. Post-independence, he served as General Secretary of the All-India Trade Union and represented Indian workers internationally. He became the first Lok Sabha member from Kanpur in 1952.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_92",
    "name": "Harilal Shastri",
    "bio": "Hiralal Shastri after completing his education joined the Jaipur State Service, eventually becoming Secretary in the Home and Foreign Departments. In 1927, he left the service to focus on social welfare, founding the organisation 'Jeevan Kutir' in 1929 to train social workers for rural reconstruction. He also established Banasthali Vidyapith, a prominent institution for women's education. In the 1920s, Shastri served as President of the Praja Mandal, a movement advocating for civil liberties against the princely rulers and British authorities. He was imprisoned for six months in 1939 due to his participation in a Satyagraha movement. In the Constituent Assembly, Shastri represented the United States of Rajasthan, where he emphasised the integration of states into the Union of India and the importance of equal representation in the Constitution-making process. Following Rajasthan's establishment as a state on March 30, 1949, he became its first Chief Minister. Although he resigned in 1951, he returned to politics in 1957, serving as a member of the second Lok Sabha from Sawai Madhopur.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_93",
    "name": "Hasrat Mohani",
    "bio": "Hasrat Mohani, in addition to being a prominent figure in India's independence movement, and a notable Urdu poet. Initially a Congress member, Mohani later joined the All-India Muslim League, though he opposed the Partition. He won the 1946 Provincial Assembly elections on Muslim League ticket. Mohani is famed for coining the revolutionary slogan 'Inquilab Zindabad' and played a significant role in the Khilafat movement. Elected to the Constituent Assembly, he actively debated issues like federalism, reservations for minorities, and the abolition of the Zamindari system.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_94",
    "name": "Himmat Singh K. Maheshwari",
    "bio": "Himmat Singh K. Maheshwari was a member of the Constituent Assembly from Sikkim and Cooch Behar States.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_95",
    "name": "Hira Vallabh Tripathi",
    "bio": "Hira Vallabh Tripathi was a member of the Constituent Assembly from United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_96",
    "name": "Hriday Nath Kunzru",
    "bio": "Initially a Congress member, Kunzru later joined the National Liberation Federation, eventually becoming its President in 1934. His political career included roles in the Legislative Council of the United Provinces, the Central Legislative Assembly, and the Council of States. He was a moderate voice in the independence movement, advocating for self-governance without supporting Satyagraha or Non-Cooperation. Elected to the Constituent Assembly from United Provinces, he contributed to debates on federalism and provincial governance. After independence, he served in the Rajya Sabha from 1952 to 1962 and was involved in the States Reorganisation Commission and the University Grants Commission.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_97",
    "name": "Hussain Imam",
    "bio": "Hussain Imam was a member of the Constituent Assembly from Bihar.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_98",
    "name": "Hyder Husein",
    "bio": "Chaudhari Hyder Husein was a distinguished Indian lawyer and politician from Uttar Pradesh. Born in Bhilwal, he was educated at M.A.O. College, Aligarh, Oxford University, and Trinity College, Dublin, before being called to the Bar at Lincoln’s Inn. Returning to India, he established a successful legal career, eventually becoming a Senior Advocate at the Supreme Court of India. In the political arena, Husein was a member of the U.P. Legislative Assembly in 1937 and was elected to the Constituent Assembly from the United Provinces. He was an active member of the Lok Sabha from 1952 to 1957. Post-independence, he focused on civil society, contributing to the Indian Council of World Affairs and founding the Rotary Club in Lucknow.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_99",
    "name": "Jadubans Sahay",
    "bio": "Jadubans Sahay was a member of the Constituent Assembly from Bihar.",
    "image": "",
    "videos": [],
    "documents": []
  },
  {
    "id": "constituent_100",
    "name": "Jagannath Baksh Singh",
    "bio": "Jagannath Baksh Singh was a member of the Constituent Assembly from the United Provinces.",
    "image": "",
    "videos": [],
    "documents": []
  }
]
